<a href="https://colab.research.google.com/github/shmilyface/DS-Unit-1-Sprint-2-Data-Wrangling-and-Storytelling/blob/master/Sequence_Narrative.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [38]:
import seaborn as sns
sns.__version__

'0.9.0'

In [0]:
%matplotlib inline
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [0]:
def start():
  options = {
      'display':{
      'max_columns': None,
      'max_colwidth': 25,
      'expand_frame_repr': False, #Don't wrap to multiple pages
      'max_rows': 50,
      'max_seq_items': 50, #Max length of printed sequence
      'precision': 4,
      'show_dimensions': False, 
      'float_format': lambda x: '%.3f' % x
  },
  'mode': {
      'chained_assignment': None #Controls SettingWithCopyWarning
      }
  }
  
  for category, option in options.items():
    for op, value in option.items():
      pd.set_option(f'{category}.{op}', value) #Python 3.6+
      
start()

In [0]:
income = pd.read_csv('https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--datapoints--income_per_person_gdppercapita_ppp_inflation_adjusted--by--geo--time.csv')

In [0]:
lifespan = pd.read_csv('https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--datapoints--life_expectancy_years--by--geo--time.csv')

In [0]:
population = pd.read_csv('https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--datapoints--population_total--by--geo--time.csv')

In [0]:
entities = pd.read_csv('https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--entities--geo--country.csv')

In [0]:
concepts = pd.read_csv('https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--concepts.csv')

In [46]:
income.shape, lifespan.shape, population.shape, entities.shape, concepts.shape

((46513, 3), (44370, 3), (59297, 3), (273, 33), (590, 16))

In [47]:
income.head()

   geo  time  income_per_person_gdppercapita_ppp_inflation_adjusted
0  afg  1800                       603
1  afg  1801                       603
2  afg  1802                       603
3  afg  1803                       603
4  afg  1804                       603

In [48]:
lifespan.head()

   geo  time  life_expectancy_years
0  abw  1800                 34.420
1  abw  1801                 34.420
2  abw  1802                 34.420
3  abw  1803                 34.420
4  abw  1804                 34.420

In [49]:
population.head()

   geo  time  population_total
0  afg  1800           3280000
1  afg  1801           3280000
2  afg  1802           3280000
3  afg  1803           3280000
4  afg  1804           3280000

In [50]:
pd.options.display.max_columns = 500
entities.head()

  country alt_5             alternative_1 alternative_2 alternative_3 alternative_4_cdiac arb1 arb2 arb3 arb4 arb5 arb6 g77_and_oecd_countries gapminder_list god_id gwid        income_groups  is--country iso3166_1_alpha2 iso3166_1_alpha3  iso3166_1_numeric iso3166_2  landlocked  latitude  longitude main_religion_2008         name        pandg  un_state unicode_region_subtag upper_case_name world_4region        world_6region
0    abkh   NaN                       NaN           NaN           NaN                 NaN  NaN  NaN  NaN  NaN  NaN  NaN                 others       Abkhazia  GE-AB   i0                  NaN         True              NaN              NaN                nan       NaN         NaN       nan        nan                NaN     Abkhazia          NaN     False                   NaN             NaN        europe  europe_central_asia
1     abw   NaN                       NaN           NaN           NaN               Aruba  NaN  NaN  NaN  NaN  NaN  NaN                 others          Aruba     AW  i12          high_income         True               AW              ABW            533.000       NaN   coastline    12.500    -69.967          christian        Aruba          NaN     False                    AW           ARUBA      americas              america
2     afg   NaN  Islamic Republic of A...           NaN           NaN         Afghanistan  NaN  NaN  NaN  NaN  NaN  NaN                    g77    Afghanistan     AF   i1           low_income         True               AF              AFG              4.000       NaN  landlocked    33.000     66.000             muslim  Afghanistan  AFGHANISTAN      True                    AF     AFGHANISTAN          asia           south_asia
3     ago   NaN                       NaN           NaN           NaN              Angola  NaN  NaN  NaN  NaN  NaN  NaN                    g77         Angola     AO   i7  upper_middle_income         True               AO              AGO             24.000       NaN   coastline   -12.500     18.500          christian       Angola       ANGOLA      True                    AO          ANGOLA        africa   sub_saharan_africa
4     aia   NaN                       NaN           NaN           NaN                 NaN  NaN  NaN  NaN  NaN  NaN  NaN                 others       Anguilla     AI   i8                  NaN         True               AI              AIA            660.000       NaN   coastline    18.217    -63.050          christian     Anguilla          NaN     False                    AI        ANGUILLA      americas              america

In [51]:
concepts.head()

                    concept color concept_type               description description_long domain drill_up indicator_url                      name              name_catalog                name_short             scales source source_long                source_url                      tags
0  adults_with_hiv_perce...   NaN      measure  The estimated percent...              NaN    NaN      NaN           NaN  Adults with HIV (%, a...  Adults with HIV (%, a...           Adults with HIV  ["log", "linear"]    NaN         NaN  https://www.gapminder...                       hiv
1  age_at_1st_marriage_w...   NaN      measure  The mean age, in year...              NaN    NaN      NaN           NaN  Age at 1st marriage (...  Age at 1st marriage (...       Age at 1st marriage  ["linear", "log"]    NaN         NaN  https://www.gapminder...                population
2  aged_15_24_employment...   NaN      measure  Percentage of total p...              NaN    NaN      NaN           NaN  Aged 15-24 employment...                Aged 15-24       Employment rate (%)  ["linear", "log"]    NaN         NaN  https://www.ilo.org/i...           employment_rate
3  aged_15_24_unemployme...   NaN      measure  Percentage of total p...              NaN    NaN      NaN           NaN  Aged 15-24 unemployme...                Aged 15-24     Unemployment rate (%)  ["linear", "log"]    NaN         NaN  https://www.ilo.org/i...              unemployment
4  aged_15_64_labour_for...   NaN      measure  For age group 15-64, ...              NaN    NaN      NaN           NaN  Aged 15-64 labour for...                Aged 15-64  Labour force particip...  ["linear", "log"]    NaN         NaN  https://www.ilo.org/i...  labour_force_particip...

In [0]:
csv_dict = {
    'income': 'https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--datapoints--income_per_person_gdppercapita_ppp_inflation_adjusted--by--geo--time.csv',
    'lifespan': 'https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--datapoints--life_expectancy_years--by--geo--time.csv',
    'population': 'https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--datapoints--population_total--by--geo--time.csv',
    'entities': 'https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--entities--geo--country.csv',
    'concepts': 'https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--concepts.csv'
}

dfs = {}

for k in csv_dict:
  dfs[k] = pd.read_csv(csv_dict[k])

In [53]:
dfs.keys()

dict_keys(['income', 'lifespan', 'population', 'entities', 'concepts'])

In [54]:
dfs['income'].head()

   geo  time  income_per_person_gdppercapita_ppp_inflation_adjusted
0  afg  1800                       603
1  afg  1801                       603
2  afg  1802                       603
3  afg  1803                       603
4  afg  1804                       603

In [55]:
dfs['lifespan'].head()

   geo  time  life_expectancy_years
0  abw  1800                 34.420
1  abw  1801                 34.420
2  abw  1802                 34.420
3  abw  1803                 34.420
4  abw  1804                 34.420

In [56]:
dfs['population'].head()

   geo  time  population_total
0  afg  1800           3280000
1  afg  1801           3280000
2  afg  1802           3280000
3  afg  1803           3280000
4  afg  1804           3280000

In [57]:
dfs['entities'].head(n=4).T

                                          0            1                         2                    3
country                                abkh          abw                       afg                  ago
alt_5                                   NaN          NaN                       NaN                  NaN
alternative_1                           NaN          NaN  Islamic Republic of A...                  NaN
alternative_2                           NaN          NaN                       NaN                  NaN
alternative_3                           NaN          NaN                       NaN                  NaN
alternative_4_cdiac                     NaN        Aruba               Afghanistan               Angola
arb1                                    NaN          NaN                       NaN                  NaN
arb2                                    NaN          NaN                       NaN                  NaN
arb3                                    NaN          NaN                       NaN                  NaN
arb4                                    NaN          NaN                       NaN                  NaN
arb5                                    NaN          NaN                       NaN                  NaN
arb6                                    NaN          NaN                       NaN                  NaN
g77_and_oecd_countries               others       others                       g77                  g77
gapminder_list                     Abkhazia        Aruba               Afghanistan               Angola
god_id                                GE-AB           AW                        AF                   AO
gwid                                     i0          i12                        i1                   i7
income_groups                           NaN  high_income                low_income  upper_middle_income
is--country                            True         True                      True                 True
iso3166_1_alpha2                        NaN           AW                        AF                   AO
iso3166_1_alpha3                        NaN          ABW                       AFG                  AGO
iso3166_1_numeric                       NaN      533.000                     4.000               24.000
iso3166_2                               NaN          NaN                       NaN                  NaN
landlocked                              NaN    coastline                landlocked            coastline
latitude                                NaN       12.500                    33.000              -12.500
longitude                               NaN      -69.967                    66.000               18.500
main_religion_2008                      NaN    christian                    muslim            christian
name                               Abkhazia        Aruba               Afghanistan               Angola
pandg                                   NaN          NaN               AFGHANISTAN               ANGOLA
un_state                              False        False                      True                 True
unicode_region_subtag                   NaN           AW                        AF                   AO
upper_case_name                         NaN        ARUBA               AFGHANISTAN               ANGOLA
world_4region                        europe     americas                      asia               africa
world_6region           europe_central_asia      america                south_asia   sub_saharan_africa

In [0]:
pd.merge?

In [0]:
df = pd.merge(dfs['income'], dfs['lifespan'])
df = pd.merge(df, dfs['population'])

In [61]:
df_v2 = dfs['income'].merge(dfs['lifespan']).merge(dfs['population'])

df_v2.sample(10)

       geo  time  income_per_person_gdppercapita_ppp_inflation_adjusted  life_expectancy_years  population_total
18504  jpn  1814                      1070                                              36.410          30785976
30453  rou  1890                      2174                                              35.730          10334055
35074  tcd  1912                       654                                              33.370           1480805
4286   blr  1878                       861                                              36.140           4016823
116    afg  1916                       841                                              30.110           5599440
14672  grc  1924                      4397                                              47.300           5973149
25548  mwi  1803                       350                                              30.300            737000
4428   blz  1801                       579                                              26.500             25526
39231  vut  1908                       791                                              25.110             39811
37618  ukr  1828                       823                                              36.600          12109894

In [62]:
df.equals(df_v2)

True

In [63]:
dfs['entities'][['country', 'name', 'world_6region']].sample(5)

               country                      name        world_6region
20                 bel                   Belgium  europe_central_asia
236                tcd                      Chad   sub_saharan_africa
224              stbar            St. Barthélemy              america
170                ncl             New Caledonia    east_asia_pacific
255  usa_minor_out_isl  US Minor Outlying Isl...                  NaN

In [65]:
df = pd.merge(df, dfs['entities'][['country', 'name', 'world_6region']], left_on='geo', right_on='country')
df.head()

   geo  time  income_per_person_gdppercapita_ppp_inflation_adjusted  life_expectancy_years  population_total country         name world_6region
0  afg  1800                       603                                              28.210           3280000     afg  Afghanistan    south_asia
1  afg  1801                       603                                              28.200           3280000     afg  Afghanistan    south_asia
2  afg  1802                       603                                              28.190           3280000     afg  Afghanistan    south_asia
3  afg  1803                       603                                              28.180           3280000     afg  Afghanistan    south_asia
4  afg  1804                       603                                              28.170           3280000     afg  Afghanistan    south_asia

In [66]:
df = df.drop(columns=['geo', 'country'])
df.head()

   time  income_per_person_gdppercapita_ppp_inflation_adjusted  life_expectancy_years  population_total         name world_6region
0  1800                       603                                              28.210           3280000  Afghanistan    south_asia
1  1801                       603                                              28.200           3280000  Afghanistan    south_asia
2  1802                       603                                              28.190           3280000  Afghanistan    south_asia
3  1803                       603                                              28.180           3280000  Afghanistan    south_asia
4  1804                       603                                              28.170           3280000  Afghanistan    south_asia

In [67]:
col_name_map = {
    'time': 'year', 
    'income_per_person_gdppercapita_ppp_inflation_adjusted': 'income', 
    'life_expectancy_years': 'lifespan', 
    'population_total': 'population', 
    'name': 'country', 
    'world_6region': 'region'
}

df = df.rename(columns=col_name_map)
df.head()

   year  income  lifespan  population      country      region
0  1800     603    28.210     3280000  Afghanistan  south_asia
1  1801     603    28.200     3280000  Afghanistan  south_asia
2  1802     603    28.190     3280000  Afghanistan  south_asia
3  1803     603    28.180     3280000  Afghanistan  south_asia
4  1804     603    28.170     3280000  Afghanistan  south_asia

In [68]:
df.shape

(40437, 6)

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 40437 entries, 0 to 40436
Data columns (total 6 columns):
year          40437 non-null int64
income        40437 non-null int64
lifespan      40437 non-null float64
population    40437 non-null int64
country       40437 non-null object
region        40437 non-null object
dtypes: float64(1), int64(3), object(2)
memory usage: 2.2+ MB

In [70]:
df.dtypes

year            int64
income          int64
lifespan      float64
population      int64
country        object
region         object
dtype: object

In [71]:
df.describe()

           year     income  lifespan     population
count 40437.000  40437.000 40437.000      40437.000
mean   1909.293   4619.493    43.132   13712042.573
std      63.309  10209.571    16.313   66063348.915
min    1800.000    247.000     1.000       2128.000
25%    1854.000    876.000    31.160     411331.000
50%    1909.000   1442.000    35.500    1985952.000
75%    1964.000   3488.000    55.970    6499707.000
max    2018.000 177522.000    84.170 1415045928.000

In [72]:
df[df['lifespan'] == 1]

       year  income  lifespan  population country             region
12214  1875     949     1.000      128811    Fiji  east_asia_pacific

In [74]:
df.describe(exclude=np.number)

            country               region
count         40437                40437
unique          187                    6
top     South Korea  europe_central_asia
freq            219                10778

In [79]:
df['country'].unique()

array(['Afghanistan', 'Angola', 'Albania', 'Andorra',
       'United Arab Emirates', 'Argentina', 'Armenia',
       'Antigua and Barbuda', 'Australia', 'Austria', 'Azerbaijan',
       'Burundi', 'Belgium', 'Benin', 'Burkina Faso', 'Bangladesh',
       'Bulgaria', 'Bahrain', 'Bahamas', 'Bosnia and Herzegovina',
       'Belarus', 'Belize', 'Bolivia', 'Brazil', 'Barbados', 'Brunei',
       'Bhutan', 'Botswana', 'Central African Republic', 'Canada',
       'Switzerland', 'Chile', 'China', "Cote d'Ivoire", 'Cameroon',
       'Congo, Dem. Rep.', 'Congo, Rep.', 'Colombia', 'Comoros',
       'Cape Verde', 'Costa Rica', 'Cuba', 'Cyprus', 'Czech Republic',
       'Germany', 'Djibouti', 'Dominica', 'Denmark', 'Dominican Republic',
       'Algeria', 'Ecuador', 'Egypt', 'Eritrea', 'Spain', 'Estonia',
       'Ethiopia', 'Finland', 'Fiji', 'France', 'Micronesia, Fed. Sts.',
       'Gabon', 'United Kingdom', 'Georgia', 'Ghana', 'Guinea', 'Gambia',
       'Guinea-Bissau', 'Equatorial Guinea', 'Greece', 'Grenada',
       'Guatemala', 'Guyana', 'Honduras', 'Croatia', 'Haiti', 'Hungary',
       'Indonesia', 'India', 'Ireland', 'Iran', 'Iraq', 'Iceland',
       'Israel', 'Italy', 'Jamaica', 'Jordan', 'Japan', 'Kazakhstan',
       'Kenya', 'Kyrgyz Republic', 'Cambodia', 'Kiribati', 'South Korea',
       'Kuwait', 'Lao', 'Lebanon', 'Liberia', 'Libya', 'St. Lucia',
       'Sri Lanka', 'Lesotho', 'Lithuania', 'Luxembourg', 'Latvia',
       'Morocco', 'Moldova', 'Madagascar', 'Maldives', 'Mexico',
       'Marshall Islands', 'Macedonia, FYR', 'Mali', 'Malta', 'Myanmar',
       'Montenegro', 'Mongolia', 'Mozambique', 'Mauritania', 'Mauritius',
       'Malawi', 'Malaysia', 'Namibia', 'Niger', 'Nigeria', 'Nicaragua',
       'Netherlands', 'Norway', 'Nepal', 'New Zealand', 'Oman',
       'Pakistan', 'Panama', 'Peru', 'Philippines', 'Papua New Guinea',
       'Poland', 'North Korea', 'Portugal', 'Paraguay', 'Palestine',
       'Qatar', 'Romania', 'Russia', 'Rwanda', 'Saudi Arabia', 'Sudan',
       'Senegal', 'Singapore', 'Solomon Islands', 'Sierra Leone',
       'El Salvador', 'Somalia', 'Serbia', 'South Sudan',
       'Sao Tome and Principe', 'Suriname', 'Slovak Republic', 'Slovenia',
       'Sweden', 'Swaziland', 'Seychelles', 'Syria', 'Chad', 'Togo',
       'Thailand', 'Tajikistan', 'Turkmenistan', 'Timor-Leste', 'Tonga',
       'Trinidad and Tobago', 'Tunisia', 'Turkey', 'Tanzania', 'Uganda',
       'Ukraine', 'Uruguay', 'United States', 'Uzbekistan',
       'St. Vincent and the Grenadines', 'Venezuela', 'Vietnam',
       'Vanuatu', 'Samoa', 'Yemen', 'South Africa', 'Zambia', 'Zimbabwe'],
      dtype=object)

In [80]:
df['country'].nunique()

187

In [81]:
df[df['year'] >= 2000].describe()

          year     income  lifespan     population
count 3547.000   3547.000  3547.000       3547.000
mean  2008.986  15994.408    69.973   36647086.352
std      5.471  18919.603     8.865  136524548.570
min   2000.000    504.000    32.110      52055.000
25%   2004.000   2868.500    64.000    2113464.500
50%   2009.000   8977.000    72.030    8229629.000
75%   2014.000  21954.500    76.765   24907906.000
max   2018.000 129350.000    84.170 1415045928.000

In [77]:
usa['year'].isin([1850, 1950])

NameError: ignored

In [0]:
usa = df[df['country'] == 'United States']
usa[usa['year'].isin([1818, 1918, 2018])]

In [0]:
now = df[df['year'] == 2018]
now.shape

In [0]:
now.sample(10)

In [0]:
sns.distplot(np.log10(now['population']))

In [0]:
sns.relplot(x='income', y='lifespan', hue='region', size='population', data=now)

In [0]:
now[now['income'] > 80000].sort_values('income')